
## Plan Result (image-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/94396)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod:257" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/imageapi-prod-app:7590ef0c106d6ff2aca68ba410b9d654f1829c53" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/imageapi-prod-app:bf7655773b204c06d98fbae8dff0146e8ea2f854"
                    name                   = "app"
                    # (11 unchanged attributes hidden)
                },
                {
                    command                = [
                        "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                    cpu                    = 0
                    environment            = []
                    essential              = true
                    image                  = "amazon/aws-otel-collector"
                    logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group         = "/ecs/ImageAPI-Prod/aws-otel-collector20231215214959212300000001"
                            awslogs-region        = "us-east-1"
                            awslogs-stream-prefix = "ecs"
                        }
                        secretOptions = []
                    }
                    mountPoints            = []
                    name                   = "aws-otel-collector"
                    portMappings           = [
                        {
                            containerPort = 4138
                            hostPort      = 4138
                            protocol      = "tcp"
                        },
                        {
                            containerPort = 4137
                            hostPort      = 4137
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    repositoryCredentials  = {
                        credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                    systemControls         = []
                    volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "ImageAPI-Prod" -> (known after apply)
      ~ revision                 = 257 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ImageAPI"
        }
        # (10 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"81a051f8-2803-4361-8891-cc682e7224a2","JobName":"image-api_infrastructure_plan_prod","PRNumber":322,"Program":"tfcmt","SHA1":"bf7655773b204c06d98fbae8dff0146e8ea2f854","Target":"image-api-cdk","Vars":{}} -->